zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/include/pio/pic32ck1012gc00064.h
#define PIN_PB07M_CCL_IN0                          _UINT32_(39)
#define MUX_PB07M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB07M_CCL_IN0                       ((PIN_PB07M_CCL_IN0 << 16) | MUX_PB07M_CCL_IN0)
#define PORT_PB07M_CCL_IN0                         (_UINT32_(1) << 7)

#define PIN_PB03M_CCL_IN1                          _UINT32_(35)
#define MUX_PB03M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB03M_CCL_IN1                       ((PIN_PB03M_CCL_IN1 << 16) | MUX_PB03M_CCL_IN1)
#define PORT_PB03M_CCL_IN1                         (_UINT32_(1) << 3)

#define PIN_PB08M_CCL_IN1                          _UINT32_(40)
#define MUX_PB08M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB08M_CCL_IN1                       ((PIN_PB08M_CCL_IN1 << 16) | MUX_PB08M_CCL_IN1)
#define PORT_PB08M_CCL_IN1                         (_UINT32_(1) << 8)

#define PIN_PB09M_CCL_IN2                          _UINT32_(41)
#define MUX_PB09M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB09M_CCL_IN2                       ((PIN_PB09M_CCL_IN2 << 16) | MUX_PB09M_CCL_IN2)
#define PORT_PB09M_CCL_IN2                         (_UINT32_(1) << 9)

#define PIN_PD02M_CCL_IN2                          _UINT32_(98)
#define MUX_PD02M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PD02M_CCL_IN2                       ((PIN_PD02M_CCL_IN2 << 16) | MUX_PD02M_CCL_IN2)
#define PORT_PD02M_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC06M_CCL_IN5                          _UINT32_(70)
#define MUX_PC06M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC06M_CCL_IN5                       ((PIN_PC06M_CCL_IN5 << 16) | MUX_PC06M_CCL_IN5)
#define PORT_PC06M_CCL_IN5                         (_UINT32_(1) << 6)

#define PIN_PC12M_CCL_IN5                          _UINT32_(76)
#define MUX_PC12M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC12M_CCL_IN5                       ((PIN_PC12M_CCL_IN5 << 16) | MUX_PC12M_CCL_IN5)
#define PORT_PC12M_CCL_IN5                         (_UINT32_(1) << 12)

#define PIN_PB00M_CCL_IN6                          _UINT32_(32)
#define MUX_PB00M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PB00M_CCL_IN6                       ((PIN_PB00M_CCL_IN6 << 16) | MUX_PB00M_CCL_IN6)
#define PORT_PB00M_CCL_IN6                         (_UINT32_(1) << 0)

#define PIN_PD08M_CCL_IN6                          _UINT32_(104)
#define MUX_PD08M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD08M_CCL_IN6                       ((PIN_PD08M_CCL_IN6 << 16) | MUX_PD08M_CCL_IN6)
#define PORT_PD08M_CCL_IN6                         (_UINT32_(1) << 8)

#define PIN_PB01M_CCL_IN7                          _UINT32_(33)
#define MUX_PB01M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PB01M_CCL_IN7                       ((PIN_PB01M_CCL_IN7 << 16) | MUX_PB01M_CCL_IN7)
#define PORT_PB01M_CCL_IN7                         (_UINT32_(1) << 1)

#define PIN_PD09M_CCL_IN7                          _UINT32_(105)
#define MUX_PD09M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD09M_CCL_IN7                       ((PIN_PD09M_CCL_IN7 << 16) | MUX_PD09M_CCL_IN7)
#define PORT_PD09M_CCL_IN7                         (_UINT32_(1) << 9)

#define PIN_PB04M_CCL_IN8                          _UINT32_(36)
#define MUX_PB04M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PB04M_CCL_IN8                       ((PIN_PB04M_CCL_IN8 << 16) | MUX_PB04M_CCL_IN8)
#define PORT_PB04M_CCL_IN8                         (_UINT32_(1) << 4)

#define PIN_PD10M_CCL_IN8                          _UINT32_(106)
#define MUX_PD10M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PD10M_CCL_IN8                       ((PIN_PD10M_CCL_IN8 << 16) | MUX_PD10M_CCL_IN8)
#define PORT_PD10M_CCL_IN8                         (_UINT32_(1) << 10)

#define PIN_PA04M_CCL_IN9                          _UINT32_(4) 
#define MUX_PA04M_CCL_IN9                          _UINT32_(12)
#define PINMUX_PA04M_CCL_IN9                       ((PIN_PA04M_CCL_IN9 << 16) | MUX_PA04M_CCL_IN9)
#define PORT_PA04M_CCL_IN9                         (_UINT32_(1) << 4)

#define PIN_PA05M_CCL_IN10                         _UINT32_(5) 
#define MUX_PA05M_CCL_IN10                         _UINT32_(12)
#define PINMUX_PA05M_CCL_IN10                      ((PIN_PA05M_CCL_IN10 << 16) | MUX_PA05M_CCL_IN10)
#define PORT_PA05M_CCL_IN10                        (_UINT32_(1) << 5)

#define PIN_PA06M_CCL_IN11                         _UINT32_(6) 
#define MUX_PA06M_CCL_IN11                         _UINT32_(12)
#define PINMUX_PA06M_CCL_IN11                      ((PIN_PA06M_CCL_IN11 << 16) | MUX_PA06M_CCL_IN11)
#define PORT_PA06M_CCL_IN11                        (_UINT32_(1) << 6)

#define PIN_PB06M_CCL_OUT0                         _UINT32_(38)
#define MUX_PB06M_CCL_OUT0                         _UINT32_(12)
#define PINMUX_PB06M_CCL_OUT0                      ((PIN_PB06M_CCL_OUT0 << 16) | MUX_PB06M_CCL_OUT0)
#define PORT_PB06M_CCL_OUT0                        (_UINT32_(1) << 6)

#define PIN_PB10M_CCL_OUT0                         _UINT32_(42)
#define MUX_PB10M_CCL_OUT0                         _UINT32_(12)
#define PINMUX_PB10M_CCL_OUT0                      ((PIN_PB10M_CCL_OUT0 << 16) | MUX_PB10M_CCL_OUT0)
#define PORT_PB10M_CCL_OUT0                        (_UINT32_(1) << 10)

#define PIN_PA00M_CCL_OUT1                         _UINT32_(0) 
#define MUX_PA00M_CCL_OUT1                         _UINT32_(12)
#define PINMUX_PA00M_CCL_OUT1                      ((PIN_PA00M_CCL_OUT1 << 16) | MUX_PA00M_CCL_OUT1)
#define PORT_PA00M_CCL_OUT1                        (_UINT32_(1) << 0)

#define PIN_PC13M_CCL_OUT1                         _UINT32_(77)
#define MUX_PC13M_CCL_OUT1                         _UINT32_(12)
#define PINMUX_PC13M_CCL_OUT1                      ((PIN_PC13M_CCL_OUT1 << 16) | MUX_PC13M_CCL_OUT1)
#define PORT_PC13M_CCL_OUT1                        (_UINT32_(1) << 13)

