zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/include/pio/pic32ck1012gc00064.h
#define PIN_PA11C_SERCOM5_PAD0                     _UINT32_(11)
#define MUX_PA11C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM5_PAD0                  ((PIN_PA11C_SERCOM5_PAD0 << 16) | MUX_PA11C_SERCOM5_PAD0)
#define PORT_PA11C_SERCOM5_PAD0                    (_UINT32_(1) << 11)

#define PIN_PA06D_SERCOM5_PAD1                     _UINT32_(6) 
#define MUX_PA06D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM5_PAD1                  ((PIN_PA06D_SERCOM5_PAD1 << 16) | MUX_PA06D_SERCOM5_PAD1)
#define PORT_PA06D_SERCOM5_PAD1                    (_UINT32_(1) << 6)

#define PIN_PA12C_SERCOM5_PAD1                     _UINT32_(12)
#define MUX_PA12C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM5_PAD1                  ((PIN_PA12C_SERCOM5_PAD1 << 16) | MUX_PA12C_SERCOM5_PAD1)
#define PORT_PA12C_SERCOM5_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA07D_SERCOM5_PAD2                     _UINT32_(7) 
#define MUX_PA07D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA07D_SERCOM5_PAD2                  ((PIN_PA07D_SERCOM5_PAD2 << 16) | MUX_PA07D_SERCOM5_PAD2)
#define PORT_PA07D_SERCOM5_PAD2                    (_UINT32_(1) << 7)

#define PIN_PB00C_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PB00C_SERCOM5_PAD2                  ((PIN_PB00C_SERCOM5_PAD2 << 16) | MUX_PB00C_SERCOM5_PAD2)
#define PORT_PB00C_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA08D_SERCOM5_PAD3                     _UINT32_(8) 
#define MUX_PA08D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM5_PAD3                  ((PIN_PA08D_SERCOM5_PAD3 << 16) | MUX_PA08D_SERCOM5_PAD3)
#define PORT_PA08D_SERCOM5_PAD3                    (_UINT32_(1) << 8)

#define PIN_PB01C_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PB01C_SERCOM5_PAD3                  ((PIN_PB01C_SERCOM5_PAD3 << 16) | MUX_PB01C_SERCOM5_PAD3)
#define PORT_PB01C_SERCOM5_PAD3                    (_UINT32_(1) << 1)

/* ================= PORT definition for SPI_IXS peripheral ================= */
#define PIN_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define MUX_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PA09J_SPI_IXS_FSYNC                 ((PIN_PA09J_SPI_IXS_FSYNC << 16) | MUX_PA09J_SPI_IXS_FSYNC)
#define PORT_PA09J_SPI_IXS_FSYNC                   (_UINT32_(1) << 9)

#define PIN_PD06J_SPI_IXS_FSYNC                    _UINT32_(102)
#define MUX_PD06J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PD06J_SPI_IXS_FSYNC                 ((PIN_PD06J_SPI_IXS_FSYNC << 16) | MUX_PD06J_SPI_IXS_FSYNC)
#define PORT_PD06J_SPI_IXS_FSYNC                   (_UINT32_(1) << 6)

#define PIN_PA11J_SPI_IXS_SCK                      _UINT32_(11)
#define MUX_PA11J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PA11J_SPI_IXS_SCK                   ((PIN_PA11J_SPI_IXS_SCK << 16) | MUX_PA11J_SPI_IXS_SCK)
#define PORT_PA11J_SPI_IXS_SCK                     (_UINT32_(1) << 11)

#define PIN_PD10J_SPI_IXS_SCK                      _UINT32_(106)
#define MUX_PD10J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PD10J_SPI_IXS_SCK                   ((PIN_PD10J_SPI_IXS_SCK << 16) | MUX_PD10J_SPI_IXS_SCK)
#define PORT_PD10J_SPI_IXS_SCK                     (_UINT32_(1) << 10)

#define PIN_PA12J_SPI_IXS_SDI                      _UINT32_(12)
#define MUX_PA12J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PA12J_SPI_IXS_SDI                   ((PIN_PA12J_SPI_IXS_SDI << 16) | MUX_PA12J_SPI_IXS_SDI)
#define PORT_PA12J_SPI_IXS_SDI                     (_UINT32_(1) << 12)

#define PIN_PD07J_SPI_IXS_SDI                      _UINT32_(103)
#define MUX_PD07J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD07J_SPI_IXS_SDI                   ((PIN_PD07J_SPI_IXS_SDI << 16) | MUX_PD07J_SPI_IXS_SDI)
#define PORT_PD07J_SPI_IXS_SDI                     (_UINT32_(1) << 7)

#define PIN_PB00J_SPI_IXS_SDO                      _UINT32_(32)
#define MUX_PB00J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PB00J_SPI_IXS_SDO                   ((PIN_PB00J_SPI_IXS_SDO << 16) | MUX_PB00J_SPI_IXS_SDO)
#define PORT_PB00J_SPI_IXS_SDO                     (_UINT32_(1) << 0)

#define PIN_PD08J_SPI_IXS_SDO                      _UINT32_(104)
#define MUX_PD08J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PD08J_SPI_IXS_SDO                   ((PIN_PD08J_SPI_IXS_SDO << 16) | MUX_PD08J_SPI_IXS_SDO)
#define PORT_PD08J_SPI_IXS_SDO                     (_UINT32_(1) << 8)

/* =================== PORT definition for SQI peripheral =================== */
#define PIN_PC06P_SQI_CLK                          _UINT32_(70)
#define MUX_PC06P_SQI_CLK                          _UINT32_(15)
#define PINMUX_PC06P_SQI_CLK                       ((PIN_PC06P_SQI_CLK << 16) | MUX_PC06P_SQI_CLK)
#define PORT_PC06P_SQI_CLK                         (_UINT32_(1) << 6)

#define PIN_PD10H_SQI_CLK                          _UINT32_(106)
#define MUX_PD10H_SQI_CLK                          _UINT32_(7) 
#define PINMUX_PD10H_SQI_CLK                       ((PIN_PD10H_SQI_CLK << 16) | MUX_PD10H_SQI_CLK)
#define PORT_PD10H_SQI_CLK                         (_UINT32_(1) << 10)

#define PIN_PC01P_SQI_CS0                          _UINT32_(65)
#define MUX_PC01P_SQI_CS0                          _UINT32_(15)
#define PINMUX_PC01P_SQI_CS0                       ((PIN_PC01P_SQI_CS0 << 16) | MUX_PC01P_SQI_CS0)
#define PORT_PC01P_SQI_CS0                         (_UINT32_(1) << 1)

#define PIN_PD06H_SQI_CS0                          _UINT32_(102)
#define MUX_PD06H_SQI_CS0                          _UINT32_(7) 
#define PINMUX_PD06H_SQI_CS0                       ((PIN_PD06H_SQI_CS0 << 16) | MUX_PD06H_SQI_CS0)
#define PORT_PD06H_SQI_CS0                         (_UINT32_(1) << 6)

#define PIN_PC00P_SQI_CS1                          _UINT32_(64)
#define MUX_PC00P_SQI_CS1                          _UINT32_(15)
#define PINMUX_PC00P_SQI_CS1                       ((PIN_PC00P_SQI_CS1 << 16) | MUX_PC00P_SQI_CS1)
#define PORT_PC00P_SQI_CS1                         (_UINT32_(1) << 0)

